CSI API ETABS v1
cGridSys.GetNameTypeList Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNameTypeList(
	ref int NumberNames,
	ref string[] GridSysName,
	ref string[] GridSysType
)
Function GetNameTypeList (
	ByRef NumberNames As Integer,
	ByRef GridSysName As String(),
	ByRef GridSysType As String()
) As Integer
Dim instance As cGridSys
Dim NumberNames As Integer
Dim GridSysName As String()
Dim GridSysType As String()
Dim returnValue As Integer
returnValue = instance.GetNameTypeList(NumberNames,
	GridSysName, GridSysType)
int GetNameTypeList(
	int% NumberNames,
	array<String^>^% GridSysName,
	array<String^>^% GridSysType
)
abstract GetNameTypeList :
        NumberNames : int byref *
        GridSysName : string[] byref *
        GridSysType : string[] byref -> int
Parameters
NumberNames
Type: System.Int32
GridSysName
Type: System.String[]
GridSysType
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cGridSys Interface
ETABSv1 Namespace